Revit 2027 API
PipePressureDropData Properties
The PipePressureDropData type exposes the following members.
Properties
Name | Description
CategoryId |  The category id of pipe curves. It will be OST_PipeCurves, OST_FlexPipeCurves, or OST_PlaceHolderPipes.
Coefficient |  The coefficient of the pipe.
Density |  The density of the pipe. Units: (kg/ft³).
Flow |  The flow of the pipe. Units: (ft³/s).
FlowState |  The flowState of the pipe.
Friction |  The friction of the pipe. Units: (kg/(ft²·s²)).
FrictionFactor |  The friction factor of the pipe.
InsideDiameter |  The inside diameter of the pipe. Units: (ft).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
KLevel |  The system calculation level.
Length |  The length of the pipe. Units: (ft).
NominalDiameter |  The nominal diameter of the pipe. Units: (ft).
OutsideDiameter |  The outside diameter of the pipe. Units: (ft).
PressureDrop |  The pressure drop of the pipe. Units: (kg/(ft·s²)).
RelativeRoughness |  The relative roughness of the pipe.
ReynoldsNumber |  The reynolds number of the pipe.
Roughness |  The roughness of the pipe. Units: (ft).
Velocity |  The velocity of the pipe. Units: (ft/s).
VelocityPressure |  The velocity pressure of the pipe. Units: (kg/(ft·s²)).
Viscosity |  The dynamic viscosity of the pipe. Units: (kg/(ft·s)).
Top
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace